# AdvancedLossFactor Constructor (AdvancedLossFactor) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AdvancedLossFactor Constructor (AdvancedLossFactor)
AdvancedLossFactor Class See Also
---
Creates a copy of the given advanced loss factor object
**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public AdvancedLossFactor(
	AdvancedLossFactor other
)
```

Visual Basic
---
```text
Public Sub New ( _
	other As AdvancedLossFactor _
)
```

Visual C++
---
```text
public:
AdvancedLossFactor(
	AdvancedLossFactor^ other
)
```

# ### Parameters
other
    Type: Autodesk.Revit.DB.Lighting..::..AdvancedLossFactor
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
AdvancedLossFactor Class
AdvancedLossFactor Overload
Autodesk.Revit.DB.Lighting Namespace